OpenFOAM-v2112-AD/tutorials/lagrangian/reactingParcelFoam/filter/system/sample
// -*- C++ -*-

sample1
{
    type        sets;
    libs        (sampling);
    setFormat   gltf;

    interpolationScheme cellPointFace;

    formatOptions
    {
        // Optionally add colours to fields
        // - default: colour map limits set to field limits
        colour          yes;

        fieldInfo
        {
            T
            {
                colourMap       fire;

                alpha           field; // uniform | field;
                //alphaValue      0.1; // uniform alpha value
                alphaField      T;
                normalise       yes;
            }
        }
    }

    fields          ( p T k epsilon U );
    writeControl    writeTime;

    sets
    (
        line
        {
            type            face;
            axis            xyz;
            start           (0 0.5 0);
            end             (4 0.5 0.05);
            nPoints         10;
        }
        cells
        {
            type            cellCentre;
        }
    );
}


// ************************************************************************* //
